#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.network-services.aws_vpc.main: Refreshing state... [id=vpc-0ca9af9621f901f0e]
module.network-services.aws_subnet.main["subnet-2"]: Refreshing state... [id=subnet-0e8847b8396228338]
module.network-services.aws_internet_gateway.main: Refreshing state... [id=igw-0cdd9183ba801e00b]
module.network-services.aws_route_table.main: Refreshing state... [id=rtb-0e04a3b6129e5cee8]
module.network-services.aws_security_group.main["ecs-lb-sg"]: Refreshing state... [id=sg-0bf19f0e9313d4059]
module.network-services.aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:targetgroup/ecs-website-tg/e6c58a4b10ba3aa6]
module.network-services.aws_subnet.main["subnet-1"]: Refreshing state... [id=subnet-05af11b9196479444]
module.network-services.aws_main_route_table_association.main: Refreshing state... [id=rtbassoc-00cbf2a5a16917e2e]
module.network-services.aws_route.main: Refreshing state... [id=r-rtb-0e04a3b6129e5cee81080289494]
module.network-services.aws_route_table_association.main["subnet-2"]: Refreshing state... [id=rtbassoc-098522999eb23276a]
module.network-services.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:loadbalancer/app/ecs-website-alb/f3d9d93264472e41]
module.network-services.aws_route_table_association.main["subnet-1"]: Refreshing state... [id=rtbassoc-0667279ae0deb7015]
module.network-services.aws_alb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/ecs-website-alb/f3d9d93264472e41/88db8e96bf861659]
module.network-services.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/ecs-website-alb/f3d9d93264472e41/d1affba9ed9cad39]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ecs-website-images"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "ecs-website-images"
        }
      + tags_all             = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "ecs-website-images"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repo_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*